using System;
using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;

// Управление общими сведениями о сборке осуществляется с помощью 
// набора атрибутов. Измените значения этих атрибутов, чтобы изменить сведения,
// связанные со сборкой.
[assembly: AssemblyTitle("Youtube DownLoader")]
[assembly: AssemblyDescription("Эта программа является свободным программным обеспечением; вы можете распространять ее и/или изменять в соответствии с условиями общей Общественной лицензии GNU, опубликованной Фондом свободного программного обеспечения; либо версия 2 Лицензии, либо (по вашему выбору) любая более поздняя версия. " + 
    "Эта программа распространяется в надежде, что она будет полезной, но без каких - либо гарантий; даже без подразумеваемой гарантии товарной пригодности или пригодности для определенной цели.Смотрите стандартную общественную лицензию GNU для получения дополнительной информации.\n\r" + 
    "Вы должны были получить копию общей Общественной лицензии GNU вместе с этой программой; если нет, напишите в Фонд свободного программного обеспечения, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("Sanshain")]
[assembly: AssemblyProduct("Youtube DownLoader")]
[assembly: AssemblyCopyright("Copyright ©  2019")]
[assembly: AssemblyTrademark("")]
[assembly: AssemblyCulture("")]

// Параметр ComVisible со значением FALSE делает типы в сборке невидимыми 
// для COM-компонентов.  Если требуется обратиться к типу в этой сборке через 
// COM, задайте атрибуту ComVisible значение TRUE для этого типа.
[assembly: ComVisible(false)]

// Следующий GUID служит для идентификации библиотеки типов, если этот проект будет видимым для COM
[assembly: Guid("f0592204-666c-41d2-bab1-ae115d7bc556")]

// Сведения о версии сборки состоят из следующих четырех значений:
//
//      Основной номер версии
//      Дополнительный номер версии 
//   Номер сборки
//      Редакция
//
// Можно задать все значения или принять номера сборки и редакции по умолчанию 
// используя "*", как показано ниже:
// [assembly: AssemblyVersion("1.0.*")]
[assembly: AssemblyVersion("1.0.0.0")]
[assembly: AssemblyFileVersion("1.0.0.0")]
